{
    "intro": "<strong>Mianxiong Dong</strong> was born in Shanghai, China. He received B.S., M.S. and Ph.D. in Computer Science and Engineering from The University of Aizu, Japan. He is the Vice President and the youngest ever Professor of Muroran Institute of Technology, Japan. He was a JSPS Research Fellow with School of Computer Science and Engineering, The University of Aizu, Japan and was a visiting scholar with BBCR group at University of Waterloo, Canada supported by JSPS Excellent Young Researcher Overseas Visit Program from April 2010 to August 2011. Dr. Dong was selected as a Foreigner Research Fellow (a total of 3 recipients all over Japan) by NEC C&C Foundation in 2011. His research interests include Wireless Networks, Cloud Computing, and Cyber-physical Systems. He has received best paper awards from IEEE HPCC 2008, IEEE ICESS 2008, ICA3PP 2014, GPC 2015, IEEE DASC 2015, IEEE VTC 2016-Fall, FCST 2017, 2017 IET Communications Premium Award and IEEE ComSoc CSIM Best Conference Paper Award 2018. Dr. Dong serves as an Editor for IEEE Transactions on Green Communications and Networking (TGCN), IEEE Communications Surveys and Tutorials, IEEE Network, IEEE Wireless Communications Letters, IEEE Cloud Computing, IEEE Access, as well as a leading guest editor for ACM Transactions on Multimedia Computing, Communications and Applications (TOMM), IEEE Transactions on Emerging Topics in Computing (TETC), IEEE Transactions on Computational Social Systems (TCSS). He has been serving as the Vice Chair of IEEE Communications Society Asia/Pacific Region Information Services Committee and Meetings and Conference Committee, Leading Symposium Chair of IEEE ICC 2019, Student Travel Grants Chair of IEEE GLOBECOM 2019, and Symposium Chair of IEEE GLOBECOM 2016, 2017. He is the recipient of IEEE TCSC Early Career Award 2016, IEEE SCSTC Outstanding Young Researcher Award 2017, The 12th IEEE ComSoc Asia-Pacific Young Researcher Award 2017, Funai Research Award 2018 and NISTEP Researcher 2018 (one of only 11 people in Japan) in recognition of significant contributions in science and technology, and Hokkaido Governor Science and Technology Encouragement Award 2019. He is currently the Member of Board of Governors and Chair of Student Fellowship Committee of IEEE Vehicular Technology Society, and Treasurer of IEEE ComSoc Japan Joint Sections Chapter. He is Clarivate Analytics 2019 Highly Cited Researcher (Web of Science). ",
    "experiences": [
        {
            "logo": "muroran.png",
            "title": "Vice President",
            "time": "2020.01 ~ present",
            "department": "",
            "belonging": "Muroran Institute of Technology",
            "address": "27-1 Mizumoto-cho, Muroran, Hokkaido, 050-8585, Japan"
        },
        {
            "logo": "muroran.png",
            "title": "Professor",
            "time": "2019.07 ~ present",
            "department": "Department of Sciences and Informatics",
            "belonging": "Muroran Institute of Technology",
            "address": "27-1 Mizumoto-cho, Muroran, Hokkaido, 050-8585, Japan"
        },
        {
            "logo": "uw.png",
            "title": "Visiting Scholar",
            "time": "2010.03 ~ 2011.08",
            "department": "Department of Electrical and Computer Engineering",
            "belonging": "University of Waterloo",
            "address": "200 University Avenue West, Waterloo, Ontario, Canada N2L 3G1"
        }
    ]
}